[{
    "client_id":156151,
    "cms_id":298,
    "location_id":2345310631,
    "service_content1":"<p>The Saint Joseph, MO, dentures dentist at Affordable Dentures<sup>&reg;</sup> will give you a good reason to smile. We provide a wide range of denture solutions, including full and partial dentures, repairs, and a New Denture Wearer Package. We're America's largest denture provider, and our office is owned and operated by Mark L. Trulsson, DMD.</p>\n\n<p>Each practice is independently owned and operated by a licensed general dentist and has an on-site dental lab that fabricates new dentures and provides repairs and relines, often with same-day service, which is convenient for our patients coming from Savannah, Elwood, Kirschner, and other cities in the region. Experienced dentists will help you find the best match for your needs, and our practice proudly provides:</p>\n\n<ul>\n<li>Emergency, routine, and complex tooth extractions</li>\n<li>Denture-retention implants</li>\n<li>Denture adjustments</li>\n<li>X-ray services</li>\n</ul>\n\n<p>Every day, Affordable Dentures improves smiles, but more importantly, we improve lives. Call today to schedule an appointment with a Saint Joseph, MO, dentures dentist. We open at 7:30am, from Monday - Friday to serve you.</p>\n\n",
    "service_content2":"<p>Saint Joseph, MO, partial dentures from Affordable Dentures<sup>&reg;</sup> may be a good solution if you're missing a few teeth. We offer several types of partial dentures for patients who aren't yet ready for full dentures. Owned and operated by Mark L. Trulsson, DMD, our practice will give you a good reason to smile. </p>\n\n<p>We also offer a New Denture Wearer Package that'll save you money if you're a first-time denture patient. As America's largest denture provider, our wide range of denture solutions includes:</p>\n\n<ul>\n<li>Cast-metal partial dentures</li>\n<li>Flexible partial dentures</li>\n<li>Acrylic partial dentures</li>\n</ul>\n\n<p>Our practice proudly provides experienced dentists who'll help you find the best match for your needs, including denture-retention implants to ensure that your dentures fit securely for a long time. Each practice is independently owned and operated by a licensed general dentist with an on-site dental lab that fabricates new dentures and provides repairs and relines, often with same-day service. Every day, Affordable Dentures improves smiles, but more importantly, we improve lives. Call today for an appointment to learn how Saint Joseph, MO, partial dentures can improve your smile.</p>\n\n",
    "service_content3":"<p>At Affordable Dentures<sup>&reg;</sup>, our Saint Joseph, MO, denture repair will give you a good reason to smile if you have cracked or stained dentures. Our practice proudly provides a wide range of denture solutions, including denture-retention implants and an on-site dental lab that fabricates new dentures and provides repairs and relines, often with same-day service. We're owned and operated by Mark L. Trulsson, DMD, and every day, we improve smiles, but more importantly, we improve lives. </p>\n\n<p>We're America's largest denture provider, and our denture services provide experienced dentists who'll help you find the best match for your needs. Each practice is also independently owned and operated by a licensed general dentist. Our repair services include:</p>\n\n<ul>\n<li>Relines for loose dentures</li>\n<li>Two types of denture repair</li>\n<li>Adjustments for dentures that cause gum soreness</li>\n</ul>\n\n<p>At Affordable Dentures, your comfort and convenience is important to us. Our professional and caring staff is proud to make your dental experience a positive one. Call today to schedule an appointment to learn how Saint Joseph, MO, denture repair can help your dentures look good and fit better.</p>\n\n",
    "homepage_title":"Saint Joseph, MO Denture Services | Denture Services Saint Joseph, MO | Affordable Dentures",
    "homepage_meta":"Looking for affordable dentures in Saint Joseph, MO? Call Affordable Dentures today for experienced denture services Saint Joseph, MO.",
    "h1_content1":"Dentures Dentist in Saint Joseph, MO",
    "service_page_title1":"Saint Joseph, MO Dentures Dentist | Dentures In Saint Joseph, MO | Affordable Dentures",
    "service_page_meta1":"Call Affordable Dentures now to learn more about dentures in Saint Joseph, MO.",
    "h1_content2":"Partial Dentures in Saint Joseph, MO",
    "service_page_title2":"Saint Joseph, MO Partial Dentures | Dentures In Saint Joseph, MO | Affordable Dentures",
    "service_page_meta2":"Call Affordable Dentures in Saint Joseph, MO for partial denture services you can rely on!",
    "h1_content3":"Denture Repair in Saint Joseph, MO",
    "service_page_title3":"Saint Joseph, MO Denture Repair | Saint Joseph, MO Dentures | Affordable Dentures",
    "service_page_meta3":"Call Affordable Dentures now to learn more about our denture repair services in Saint Joseph, MO.",
    "tracking":"<script src=\"http://www.yodleresources.net/Unified/embed.js\" type=\"text/javascript\" async=\"true\" id=\"unified-tracking\" data-config=\"affdentures:seotracking-saintjoseph.net\"></script>"
},

{
    "client_id":108774,
    "cms_id":49,
    "location_id":1726066292,
    "service_content1":"<p>A St. Clairsville, OH, dentures dentist gives people a good reason to smile, and at Affordable Dentures<sup>&reg;</sup>, we're America's largest denture provider that offers a wide range of denture solutions. Our experienced dentists, including owner and operator Michael R. McClure, DDS, will help you find the best match for your needs with same-day service in some cases, and our everyday low fees make it possible for you to improve the fit of your dentures. </p>\n\n<p>Each practice is independently owned and operated by a licensed general dentist. Our practice proudly provides our denture services to patients from St. Clairsville, Wheeling, and many other towns in the region, and our services include:</p>\n\n<ul>\n<li>Complete and partial dentures</li>\n<li>New Denture Wearer PackageSM</li>\n<li>Repairs, adjustments, and relines for broken or uncomfortable dentures</li>\n<li>Denture-retention implants</li>\n<li>Tooth extractions</li>\n</ul>\n\n<p>Affordable Dentures will help improve your smile, but more importantly, we help improve lives. Our on-site dental lab fabricates new dentures and provides repairs and relines, often with same-day service. A St. Clairsville, OH, dentures dentist is open at 7:30am, Monday - Friday. Call today to take advantage of our professional and compassionate care, and see what a new smile can do for your confidence. </p>",
    "service_content2":"<p>America's largest denture provider offers St. Clairsville, OH, partial dentures. At our Affordable Dentures<sup>&reg;</sup> office, which is owned and operated by Michael R. McClure, DDS, we provide several types of partial dentures that'll give you a good reason to smile. Our denture services are affordable with everyday low fees, including our New Denture Wearer PackageSM, to help people have the smile they deserve. </p>\n\n<p>Each practice has an on-site dental lab that fabricates new dentures and provides repairs and relines, often with same-day service. Experienced dentists will help you find the best match for your needs, and we proudly provides a wide range of denture solutions, including three main types of partial dentures:</p>\n\n<ul>\n<li>Cast-metal partial dentures for good fit and durability</li>\n<li>Acrylic partial dentures that are the most affordable</li>\n<li>Flexible partial dentures for added comfort</li>\n</ul>\n\n<p>Our St. Clairsville, OH, partial dentures offer natural looking teeth that help boost personal confidence in patients. Our dental staff gives compassionate care to help patients relax when they visit the dentist. Each office of Affordable Dentures is independently owned and operated by a licensed general dentist. Call today for an appointment to see what partial dentures can do for you.</p>",
    "service_content3":"<p>A St. Clairsville, OH, denture repair from Affordable Dentures<sup>&reg;</sup> will give you a good reason to smile. Our practice proudly provides a wide range of denture solutions for broken, chipped, or stained dentures. There are two main types of denture repairs: simple repairs and repairs that need new impressions. Experienced dentists, including Michael R. McClure, DDS who owns and operates our practice, will help you find the best match for your needs, and each practice has an on-site dental lab that fabricates new dentures, often with same-day service.</p>\n\n<p>Our denture repair services include:</p>\n\n<ul>\n<li>Repairs of both types</li>\n<li>Relines to make the denture fit the gum better</li>\n<li>Adjustments when the denture is causing soreness to the gums</li>\n</ul>\n\n<p>As America's largest denture provider, Affordable Dentures improves smiles, but more importantly, we improve lives. Our denture services for adjustments are available at no charge for the first 60 days after you've been fitted with your dentures from our office. Independently owned and operated by a licensed general dentist, our St. Clairsville, OH, denture repair can make your dentures like new and put the smile back on your face. Call today for an appointment to make your dentures comfortable again.</p>",
    "homepage_title":"St. Clairsville, OH Denture Services | Denture Services In St. Clairsville | Affordable Dentures",
    "homepage_meta":"Looking for affordable dentures in St. Clairsville, OH? Call Affordable Dentures today for experienced denture services St. Clairsville, OH.",
    "h1_content1":"Dentures Dentist in St. Clairsville, OH",
    "service_page_title1":"Dentures St. Clairsville, OH | Dentures Dentist St. Clairsville | Affordable Dentures",
    "service_page_meta1":"Call Affordable Dentures in St. Clairsville, OH for denture services you can rely on!",
    "h1_content2":"Partial Dentures in St. Clairsville, OH",
    "service_page_title2":"St. Clairsville, OH Partial Dentures | Dentures In St. Clairsville | Affordable Dentures",
    "service_page_meta2":"Call Affordable Dentures now to learn more about partial dentures in St. Clairsville, OH.",
    "h1_content3":"Denture Repair in St. Clairsville, OH",
    "service_page_title3":"St. Clairsville Denture Repair | St. Clairsville, OH Dentures | Affordable Dentures",
    "service_page_meta3":"Call Affordable Dentures now to learn more about denture repair in St. Clairsville, OH.",
    "tracking":"<script src=\"http://www.yodleresources.net/Unified/embed.js\" type=\"text/javascript\" async=\"true\" id=\"unified-tracking\" data-config=\"affdentures:seotracking-st.clairsville.net\"></script>"
}]